Revit 2024 API
FilteredWorksetCollector Methods
The FilteredWorksetCollector type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FirstWorkset
 Returns the first workset to pass the filter(s).
FirstWorksetId
 Returns the id of the first workset to pass the filter(s).
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWorksetIdIterator
 Returns a FilteredWorksetIdIterator to the worksets passing the current filter.
GetWorksetIterator
 Returns a FilteredWorksetIterator to the worksets passing the current filter.
OfKind
 Applies a WorksetKindFilter to the collector.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
ToWorksetIds
 Returns the complete set of workset ids that pass the filter(s).
ToWorksets
 Returns the complete set of worksets that pass the filter(s).
WherePasses
 Applies a workset filter to the collector.
See Also
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace